CSI API ETABS v1
cDetailing.GetDetailedSlab_OneDetailingOutputInfo Method
 Detailing output of one slab on a particular floor
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedSlab_OneDetailingOutputInfo(
	int DetailingOutputIndex,
	ref string Guid_ETABS,
	ref string Floor,
	ref string StoryNameETABS,
	ref double LevelZ,
	ref int NumberStrips
)
Function GetDetailedSlab_OneDetailingOutputInfo (
	DetailingOutputIndex As Integer,
	ByRef Guid_ETABS As String,
	ByRef Floor As String,
	ByRef StoryNameETABS As String,
	ByRef LevelZ As Double,
	ByRef NumberStrips As Integer
) As Integer
Dim instance As cDetailing
Dim DetailingOutputIndex As Integer
Dim Guid_ETABS As String
Dim Floor As String
Dim StoryNameETABS As String
Dim LevelZ As Double
Dim NumberStrips As Integer
Dim returnValue As Integer
returnValue = instance.GetDetailedSlab_OneDetailingOutputInfo(DetailingOutputIndex,
	Guid_ETABS, Floor, StoryNameETABS,
	LevelZ, NumberStrips)
int GetDetailedSlab_OneDetailingOutputInfo(
	int DetailingOutputIndex,
	String^% Guid_ETABS,
	String^% Floor,
	String^% StoryNameETABS,
	double% LevelZ,
	int% NumberStrips
)
abstract GetDetailedSlab_OneDetailingOutputInfo :
        DetailingOutputIndex : int *
        Guid_ETABS : string byref *
        Floor : string byref *
        StoryNameETABS : string byref *
        LevelZ : float byref *
        NumberStrips : int byref -> int
Parameters
DetailingOutputIndex
Type: System.Int32
 Detailing Output Index
Guid_ETABS
Type: System.String
 ETABS GUID
Floor
Type: System.String
 Floor ID in CSiDetail, based on ETABS story Name
StoryNameETABS
Type: System.String
 Story Name from ETABS
LevelZ
Type: System.Double
 The reference Level of the slab where Design Strips lie
NumberStrips
Type: System.Int32
 Number of Strips present in current detailing output
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace